<template>
    <div>
        <v-dialog resisten max-width="560px">
            <template v-slot:activator="{ on }">
                <button
                        :elevation="hover ? 16:2" v-on="on"  dark>
                        <v-icon> mdi-chevron-right </v-icon>
                </button>
            </template>

                <v-card align="center">
                    <v-card-title>개인정보 수집 및 이용 동의 (필수)</v-card-title>
                    <v-card-text> 
                        _________________ 귀중
                            여행 상품 계약을 이행하기 위하여 아래와 같이 귀하의 개인정보를 수집/이용/제공하는 내용에 대하여 동의를 받고자 합니다
                            <br>1. 개인정보의 수집/이용에 관한 사항
                            개인정보보호법에 따라 귀하의 개인정보를 다음과 같이 수집/이용하고자 합니다. 이에 동의하십니까?
                            (동의함 □ 동의안함 □)
                            <br>● 개인정보 수집/이용 목적
                            고객님으로부터 수집하는 개인정보 수집 항목, 용도는 아래와 같습니다.
                            <br>● 수집/이용하는 개인정보의 항목 및 목적
                            개인정보 수집/이용 항목 수집/이용 목적
                            성명(국문/영문), 성별, 생년월일, 연락처, 이메일주소 여행상품 상담 및 예약
                            성명, 생년월일, 성별, 여권번호(해외여행상품), 주민번호 여행자보험 가입
                            성명, 연락처, 생년월일, 이메일주소, 주소, ________마일리지 회원번호
                            마일리지 서비스 제공
                            (마일리지 회원일 경우)
                            성명(국문/영문), 생년월일, 성별, 여권/비자 소지여부, 여권정보(영문명, 여권번호,
                            여권만료일)
                            예약 및 출국가능 여부 파악
                            성명, 신용카드정보(카드번호, 유효기간) 대금결제/정산
                            <br>● 개인정보의 이용/보유기간
                            고객님의 개인정보는 서비스를 제공하는 기간 또는 분쟁처리 기간 동안에 한하여 보유하며 정보주체자의 삭제 요구가 있을
                            경우 지체 없이 파기합니다. 단, 관계법령의 규정에 의하여 보존할 필요가 있는 경우는 아래와 같이 관계법령에서 정한 일
                            정기간 동안 고객정보를 안전하게 보관합니다.
                            <br>가. 계약 또는 청약철회 등에 관한 기록 : 5년 (전자상거래 등에서의 소비자보호에 관한 법률)
                            <br>나. 대금결재 및 재화 등의 공급에 관한 기록 : 5년 (전자상거래 등에서의 소비자보호에 관한 법률)
                            <br>다. 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년(전자상거래 등에서의 소비자보호에 관한 법률)
                            개인정보 수집 및 이용에 대한 동의 동의함 ( ) 동의 안 함 ( )
                            <br>2. 개인정보 제3자 제공에 관한 사항
                            개인정보보호법에 따라 귀하의 개인정보를 다음과 같이 제3자에게 제공하고자 합니다. 이에 동의하십니까?
                            (동의함 □ 동의안함 □)
                            <br>●개인정보 제공 받는 자/ 개인정보를 제공하는 항목/ 개인정보를 제공받는 자의 이용 목적
                            개인정보를 제공받는 자 개인정보를 제공하는 항목 개인정보를 제공받는 자의 이용목적
                            항공/해운/운송업체
                            영문명, 생년월일, 성별, 연락처(이메일/휴대폰)
                            여권정보(영문명,여권번호,여권만료일),
                            항공,선박 등 운송업체 예약
                            국내외 호텔 및 숙박업체 성명(국문/영문), 연락처 숙박예약 진행,확인
                            여행사 성명(국문/영문), 생년월일, 성별, 연락처 여행상품 상담 및 예약관리
                            보험사 성명, 성별, 생년월일, 여권번호(해외여행상품), 주민번호 여행자보험 가입 및 보험금 지급
                            비자대행업체 성명, 여권정보(영문명, 여권번호,만료일) 비자 수속 진행
                            <br>● 개인정보의 제공받는 자의 이용/보유기간
                            고객님의 개인정보는 서비스를 제공하는 기간 또는 분쟁처리 기간 동안에 한하여 보유하며 정보주체자의 삭제 요구가 있을
                            경우 지체 없이 파기합니다. 단, 관계법령의 규정에 의하여 보존할 필요가 있는 경우는 아래와 같이 관계법령에서 정한 일
                            정기간 동안 고객정보를 안전하게 보관합니다.
                            가. 여행자보험계약의 거래 종료일로부터 5년
                            나. 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년(전자상거래 등에서의 소비자보호에 관한 법률)
                            ※ 고객님께서는 개인정보 제3자 동의에 대하여 거부할 권리가 있습니다. 단, 거부하실 경우 관련 서비스를 제공 받으실 수
                            없습니다.
                            개인정보 수집 및 이용에 대한 동의 동의함 ( ) 동의안함 ( )
                            <br>3. 고유식별정보의 처리에 관한 사항
                            개인정보보호법에 따라 상기의 개인정보에 대한 개별 동의사항에 대하여 다음과 같이 고유식별정보를 처리(수집, 이용, 제공)
                            하고자 합니다. 이에 동의하십니까?
                            (동의함 □ 동의안함 □)
                            <br>● 수집/이용/제공하는 고유식별정보
                            <br>- 주민번호, 외국인등록번호, 여권번호, 운전면허번호 등
                            <br>20 년 월 일
                            <br>○ 동의자 :_________________(서명) ○ 법정대리인 :________________(서명)
                            <br>※ 동의자가 본인인 경우 동의자란에 서명하여 주시고, 만 14세 미만 미성년자의 경우 법정대리인이 법정대리인란에 서명하
                            여 주시기 바랍니다.
                    </v-card-text>
                    <v-card-actions>
                        <v-spacer></v-spacer>
                        <v-btn>
                            확인
                        </v-btn>
                        <v-spacer></v-spacer>
                    </v-card-actions>

                </v-card>

      </v-dialog>
    </div>
</template>

<script>
export default {
    name: 'AgreeDialogThree', 
}
</script>
